In [1]:
import pandas as pd
import numpy as np

In [ ]:
#2. 판다스 버전 출력
pd.__version__

In [ ]:
#3. 판다스 라이브러리 버전 정보 모두 출력
pd.show_versions()

In [ ]:
#4. 주어진 값으로 DF생성,출력
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data, index=labels)
df

In [ ]:
#5. 내부 정보 출력
df.describe()

In [ ]:
#6. 상위 3열 출력
df.head(3)

In [ ]:
#7. animal, age 컬럼 출력
df[['animal', 'age']]

In [ ]:
#8. 3,4,8번 행의 animal,age값 출력
df.loc[df.index[[2, 3, 7]], ['animal', 'age']]

In [ ]:
#9. visit컬럼에서 2초과하는 값 출력
df[df['visits'] > 2]

In [ ]:
#10. age에서 NaN값 출력
df[df['age'].isnull()]

In [ ]:
#11. age가 3살 미만인 cat 값 출력
df[(df['animal'] == 'cat') & (df['age'] < 3)]

In [ ]:
#12. age가 2살 이상 4살 미만인 값 출력
df[df['age'].between(2, 4)]

In [ ]:
#13. f행의 age를 1.5로 변경
df.loc['f', 'age'] = 1.5
df

In [ ]:
#14. visit 의 합 출력
df['visits'].sum()

In [ ]:
#15. 동물별로 age 평균값 출력
df.groupby('animal')['age'].mean()

In [ ]:
#16-1. k행추가, age=5.5, animal=dog, visits=2, priority=no
df.loc['k'] = ['dog', 5.5, '2', 'no']
df

In [ ]:
#16-2. k행삭제
df = df.drop('k')
df

In [ ]:
#17. 동물종류별 수량 출력
df['animal'].value_counts()

In [ ]:
#18. age는 내림차순, visits는 오름차순 정렬
df.sort_values(by=['age', 'visits'], ascending=[False, True])

In [ ]:
#19. priority의 yes를 True, no를 False로 맵핑후 출력
df['priority'] = df['priority'].map({'yes': True, 'no': False})
df

In [ ]:
#20. snake를 python 으로 변경
df['animal'] = df['animal'].replace('snake', 'python')
df

In [ ]:
#21. 
df.pivot_table(index='animal', columns='visits', values='age', aggfunc='mean')

In [ ]:
# 22. 다음 객체에서 키값 A와 중복된 값이 제거된 1,2,3,4,5,6,7 이 출려되는 코드를 작성
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df.loc[df['A'].shift() != df['A']]

In [ ]:
# 23. 다음 객체에서 행의 각 요소에서 행의 평균을 뺀 값을 출력
df = pd.DataFrame(np.random.random(size=(5, 3)))
df.sub(df.mean(axis=1), axis=0)

In [ ]:
#24. 다음 객체에서 가장 작은 합계를 가진 숫자열의 열을 출력
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
df.sum().idxmin()

In [ ]:
# 25. 다음 객체에서 중복된 값이 없는 유니크한 열의 카운트 출력(중복되지 않은 행은 몇 개..)
df = pd.DataFrame(np.random.randint(0, 2, size=(10, 3)))
len(df.drop_duplicates(keep=False))

In [ ]:
# 26. 객체의 각 행에 대해 세번째 NaN 값이 들어 있는 열을 찾으시오. 일련의 열 레이블을 반환해야 합니다.
# 답은 e, c, d, h, d 입니다.
nan = np.nan
data = [[0.04,  nan,  nan, 0.25,  nan, 0.43, 0.71, 0.51,  nan,  nan],
        [ nan,  nan,  nan, 0.04, 0.76,  nan,  nan, 0.67, 0.76, 0.16],
        [ nan,  nan, 0.5 ,  nan, 0.31, 0.4 ,  nan,  nan, 0.24, 0.01],
        [0.49,  nan,  nan, 0.62, 0.73, 0.26, 0.85,  nan,  nan,  nan],
        [ nan,  nan, 0.41,  nan, 0.05,  nan, 0.61,  nan, 0.48, 0.68]]
columns = list('abcdefghij')
df = pd.DataFrame(data, columns=columns)
(df.isnull().cumsum(axis=1) == 3).idxmax(axis=1)

In [ ]:
# 27. For each group, find the sum of the three greatest values.
# 출력 결과는 
#  grps
#   a    409
#   b    156
#   c    345
# 이렇게 나옵니다.
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
df.groupby('grps')['vals'].nlargest(3).sum(level=0)

In [ ]:
# 28 다음 객체를 list 로 변환하시오
df = pd.DataFrame({'A':[1,2,3], 'B':[4,5,6]})
df.values.tolist()

In [ ]:
# 29 다음 객체를 dictionary 로 변환하시오
df = pd.DataFrame({'A':[1,2,3], 'B':[4,5,6]})
df.to_dict()

In [ ]:
# 30 다음 객체를 customer_id 를 인덱스로하고 product_code 를 컬럼으로, purchare_amount 를 값으로, 재구성하시오
df = pd.DataFrame({"customer_id":['kim','lee','park','song','yoon','kang','tak','ryu','jang'],
               "product_code":['com','phone','tv','com','phone','tv','com','phone','tv'],
               "grade":['A','A','A','A','A','A','B','B','B'],
               "purchase_amount":[30,10,0,40,15,30,0,0,10]})
df = pd.pivot_table(df, index='customer_id', columns='product_code', values='purchase_amount')
df

In [ ]:
# 31 30번 객체를 
#    customer_id 와 grade 를 인덱스로하고 product_code 를 컬럼으로, 
#    purchare_amount 를 값으로, 재구성하시오
df = pd.DataFrame({"customer_id":['kim','lee','park','song','yoon','kang','tak','ryu','jang'],
               "product_code":['com','phone','tv','com','phone','tv','com','phone','tv'],
               "grade":['A','A','A','A','A','A','B','B','B'],
               "purchase_amount":[30,10,0,40,15,30,0,0,10]})
df = pd.pivot_table(df, index=['customer_id', 'grade'], columns='product_code', values='purchase_amount')
df

In [11]:
'''
melt() 는 ID 변수를 기준으로 원래 데이터셋에 있던 여러개의 칼럼 이름을
'variable' 칼럼에 위에서 아래로 길게 쌓아놓고,
'value' 칼럼에 ID와 variable에 해당하는 값을
넣어주는 식으로 데이터를 재구조화
'''
df = pd.DataFrame({"customer_id":['kim','kim','lee','lee'],
               "product_code":['com','phone','tv','tab'],
               "purchase_count":[1,2,3,4],
               "purchase_amount":[100,200,300,400]})


# (1) pd.melt(data, id_vars=['id1', 'id2', ...]) 를 사용한 데이터 재구조화
df = pd.melt(df, id_vars=['customer_id', 'product_code'])


# (2) pd.melt() 의 variable 이름, value 이름 부여하기 : var_name, value_name
df = pd.melt(df, id_vars=['customer_id', 'product_code'], var_name='purchase_code',
            value_name='purchase_value')
df

   customer_id product_code purchase_code   purchase_value
0          kim          com      variable   purchase_count
1          kim        phone      variable   purchase_count
2          lee           tv      variable   purchase_count
3          lee          tab      variable   purchase_count
4          kim          com      variable  purchase_amount
5          kim        phone      variable  purchase_amount
6          lee           tv      variable  purchase_amount
7          lee          tab      variable  purchase_amount
8          kim          com         value                1
9          kim        phone         value                2
10         lee           tv         value                3
11         lee          tab         value                4
12         kim          com         value              100
13         kim        phone         value              200
14         lee           tv         value              300
15         lee          tab         value              400

In [10]:
'''
pd.crosstab()
범주형 변수로 되어있는 요인(factors)별로 교차분석(cross tabulations) 해서,
행, 열 요인 기준 별로 빈도를 세어서 도수분포표(frequency table),
교차표(contingency table) 를 생성한다

# 범주형 변수란 고유한 값이나 범주 수가 제한된 변수(예: 성별 또는 종교)이다.
# 교차분석(cross-tabulation analysis)은 '범주형'으로 구성된 자료들 간의 연관관계를 확인하기 위해
   교차표를 만들어 관계를 확인하는 분석 방법이다.
'''
df = pd.DataFrame({"student_ID" :["kim","kim","kim","lee","lee","park"],
                   "1st_semester_grade":["A","A","A","B","B","B"],
                   "2nd_semester_grade":["D","D","D","C","C","D"]})

# (1) 교차표(contingency table, frequency table) 만들기 : pd.crosstab(index, columns)


# (2) Multi-index, Multi-level로 교차표 만들기 : pd.crosstab([id1, id2], [col1, col2])
df2 = pd.crosstab(index = df['student_ID'], 
                 columns = [df['1st_semester_grade'], df['2nd_semester_grade']])

# (3) 교차표의 행 이름, 열 이름 부여 : pd.crosstab(rownames=['xx'], colnames=['aa'])


# (4) 교차표의 행 합, 열 합 추가하기 : pd.crosstab(margins=True)
df4 = pd.crosstab(index = df['student_ID'], 
                 columns = [df['1st_semester_grade'], df['2nd_semester_grade']],
                 margins=True)

# (5) 구성비율로 교차표 만들기 : pd.crosstab(normalize=True)
df5 = pd.crosstab(index = df['student_ID'], 
                 columns = [df['1st_semester_grade'], df['2nd_semester_grade']],
                 normalize=True)
df5

1st_semester_grade    A         B
2nd_semester_grade    D         C         D
student_ID
kim                 0.5  0.000000  0.000000
lee                 0.0  0.333333  0.000000
park                0.0  0.000000  0.166667